Revit 2027 API
FaceToposolid.UpdateToFace Method
 Resets the face toposolid to its defining faces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UpdateToFace()
Public Sub UpdateToFace
public:
void UpdateToFace()
member UpdateToFace : unit -> unit
See Also
Reference
FaceToposolid Class
Autodesk.Revit.DB Namespace